[{"description":"Create Screen 1 - Welcome Screen with app logo/tagline 'Speak Confidently in 30 Days', two prominent language selection buttons ('I want to learn ENGLISH' and 'Quiero aprender ESPAÑOL'), and an animated illustration of diverse people talking. Make it welcoming and energetic.","type":"feature","passes":true,"id":1},{"description":"Create Screen 2 - Goal Selection with heading 'Why do you want to learn?' and multi-select checkboxes for: Travel, Work/Career, Talk to family/friends, Move to a new country, Feel more confident, Help my children. Include a Continue button.","type":"feature","passes":true,"id":2},{"description":"Create Screen 3 - Current Level Assessment with heading 'How much do you know?' and radio button options: Complete beginner, I know some words but can't speak, I can have basic conversations, I'm intermediate but not confident. Include Continue button.","type":"feature","passes":true,"id":3},{"description":"Create Screen 4 - Time Commitment with heading 'How much time can you practice daily?' and radio button options: 5 minutes, 10 minutes, 15-20 minutes, 30+ minutes. Include Continue button.","type":"feature","passes":true,"id":4},{"description":"Create Screen 5 - Personalized Promise displaying 'Based on your goals, here's your 30-day roadmap...' with a personalized learning path preview based on previous selections. Add a prominent CTA button 'Start My Transformation'.","type":"feature","passes":true,"id":5},{"description":"Create Screen 6 - Account Creation with fields for Name, Email, Password, and alternative 'Sign up with Google' and 'Sign up with Apple' buttons. Include checkbox for 'Receive daily motivation texts/emails'. Add final Submit/Get Started button.","type":"feature","passes":true,"id":6},{"description":"Implement smooth navigation between all 6 screens with progress indicators, back buttons where appropriate, and form validation. Store user selections throughout the flow and display personalized content on Screen 5 based on their choices.","type":"feature","passes":true,"id":7},{"description":"Create main dashboard screen that appears after onboarding is complete. Add top section with: personalized greeting switching between '¡Hola, [Name]!' and 'Hey, [Name]!' based on selected language, streak counter showing '🔥 7 Day Streak', circular progress ring showing 'Day 12 of 30', and daily goal status 'Today's lesson: 0/1 completed'. Make this section visually prominent and motivating.","type":"feature","passes":true,"id":8},{"description":"Create middle scrollable section with 5 course module cards. Module 1: Core Phrases (Day 1-3) UNLOCKED with lessons: 1.1 The 50 Power Phrases, 1.2 Pronunciation Training, 1.3 Daily Speaking Warmups, and Quiz: Core Phrases Check. Module 2: Real-Life Situations (Day 4-10) with lessons: 2.1 Travel & Transportation, 2.2 Food & Restaurants, 2.3 Shopping Essentials, 2.4 Emergency Communication, and Quiz: Situation Mastery. Show locked/unlocked states based on progress.","type":"feature","passes":true,"id":9},{"description":"Add Module 3: Building Confidence (Day 11-15) with lessons: 3.1 Overcoming Speaking Fear, 3.2 The Confidence Loop Method, 3.3 Accent Training, and Quiz: Confidence Check. Module 4: Real Conversations (Day 16-30) with lessons: 4.1 Meeting People, 4.2 Asking Questions Naturally, 4.3 Storytelling Basics, 4.4 Practice Conversations, and Final Assessment. Module 5: Everyday Life Mastery (BONUS) with lessons: 5.1 Phone Calls, 5.2 Workplace Basics, 5.3 Appointments, 5.4 Giving & Getting Directions. Show appropriate locked states and visual hierarchy.","type":"feature","passes":true,"id":10},{"description":"Create bottom navigation bar with 6 tabs: Home (Dashboard) with 🏠 icon, Lessons with 📚 icon, Audio Practice with 🎧 icon, Workbook with 📝 icon, Progress with 🏆 icon, and Settings with ⚙️ icon. Make it sticky, mobile-friendly, with active state highlighting. Ensure smooth transitions between sections.","type":"feature","passes":true,"id":11},{"description":"Add interactivity to module cards: clicking unlocked lessons should show lesson detail/start lesson view, locked lessons should show tooltip explaining unlock requirements, completed items should show checkmarks, and current lesson should be highlighted. Add smooth animations for card interactions and scroll behavior.","type":"feature","passes":true,"id":12}]
