[{"description":"Create Screen 1 - Welcome Screen with app logo/tagline 'Speak Confidently in 30 Days', two prominent language selection buttons ('I want to learn ENGLISH' and 'Quiero aprender ESPAÑOL'), and an animated illustration of diverse people talking. Make it welcoming and energetic.","type":"feature","passes":true,"id":1},{"description":"Create Screen 2 - Goal Selection with heading 'Why do you want to learn?' and multi-select checkboxes for: Travel, Work/Career, Talk to family/friends, Move to a new country, Feel more confident, Help my children. Include a Continue button.","type":"feature","passes":true,"id":2},{"description":"Create Screen 3 - Current Level Assessment with heading 'How much do you know?' and radio button options: Complete beginner, I know some words but can't speak, I can have basic conversations, I'm intermediate but not confident. Include Continue button.","type":"feature","passes":true,"id":3},{"description":"Create Screen 4 - Time Commitment with heading 'How much time can you practice daily?' and radio button options: 5 minutes, 10 minutes, 15-20 minutes, 30+ minutes. Include Continue button.","type":"feature","passes":true,"id":4},{"description":"Create Screen 5 - Personalized Promise displaying 'Based on your goals, here's your 30-day roadmap...' with a personalized learning path preview based on previous selections. Add a prominent CTA button 'Start My Transformation'.","type":"feature","passes":true,"id":5},{"description":"Create Screen 6 - Account Creation with fields for Name, Email, Password, and alternative 'Sign up with Google' and 'Sign up with Apple' buttons. Include checkbox for 'Receive daily motivation texts/emails'. Add final Submit/Get Started button.","type":"feature","passes":true,"id":6},{"description":"Implement smooth navigation between all 6 screens with progress indicators, back buttons where appropriate, and form validation. Store user selections throughout the flow and display personalized content on Screen 5 based on their choices.","type":"feature","passes":true,"id":7},{"description":"Create main dashboard screen that appears after onboarding is complete. Add top section with: personalized greeting switching between '¡Hola, [Name]!' and 'Hey, [Name]!' based on selected language, streak counter showing '🔥 7 Day Streak', circular progress ring showing 'Day 12 of 30', and daily goal status 'Today's lesson: 0/1 completed'. Make this section visually prominent and motivating.","type":"feature","passes":true,"id":8},{"description":"Create middle scrollable section with 5 course module cards. Module 1: Core Phrases (Day 1-3) UNLOCKED with lessons: 1.1 The 50 Power Phrases, 1.2 Pronunciation Training, 1.3 Daily Speaking Warmups, and Quiz: Core Phrases Check. Module 2: Real-Life Situations (Day 4-10) with lessons: 2.1 Travel & Transportation, 2.2 Food & Restaurants, 2.3 Shopping Essentials, 2.4 Emergency Communication, and Quiz: Situation Mastery. Show locked/unlocked states based on progress.","type":"feature","passes":true,"id":9},{"description":"Add Module 3: Building Confidence (Day 11-15) with lessons: 3.1 Overcoming Speaking Fear, 3.2 The Confidence Loop Method, 3.3 Accent Training, and Quiz: Confidence Check. Module 4: Real Conversations (Day 16-30) with lessons: 4.1 Meeting People, 4.2 Asking Questions Naturally, 4.3 Storytelling Basics, 4.4 Practice Conversations, and Final Assessment. Module 5: Everyday Life Mastery (BONUS) with lessons: 5.1 Phone Calls, 5.2 Workplace Basics, 5.3 Appointments, 5.4 Giving & Getting Directions. Show appropriate locked states and visual hierarchy.","type":"feature","passes":true,"id":10},{"description":"Create bottom navigation bar with 6 tabs: Home (Dashboard) with 🏠 icon, Lessons with 📚 icon, Audio Practice with 🎧 icon, Workbook with 📝 icon, Progress with 🏆 icon, and Settings with ⚙️ icon. Make it sticky, mobile-friendly, with active state highlighting. Ensure smooth transitions between sections.","type":"feature","passes":true,"id":11},{"description":"Add interactivity to module cards: clicking unlocked lessons should show lesson detail/start lesson view, locked lessons should show tooltip explaining unlock requirements, completed items should show checkmarks, and current lesson should be highlighted. Add smooth animations for card interactions and scroll behavior.","type":"feature","passes":true,"id":12},{"description":"Create lesson page header with back arrow to return to dashboard, module name display, lesson title (e.g., 'The 50 Power Phrases'), horizontal progress bar showing lesson completion percentage, and estimated time badge showing '⏱️ 10 min'. Make navigation intuitive and progress clearly visible.","type":"feature","passes":true,"id":13},{"description":"Build Section A: Video/Audio Introduction with a media player for 1-3 minute intro, instructor explanation of lesson goals, and 'What you'll learn today...' text preview. Include play/pause controls and progress scrubber. Make it engaging and informative.","type":"feature","passes":true,"id":14},{"description":"Create Section B: Core Content with phrase cards displaying English phrase in large text, Spanish translation in large text, 🔊 audio pronunciation button for both languages that plays native speaker audio, 🎤 'Record yourself' button to capture user pronunciation, and 📌 'Save to favorites' button. Make cards visually appealing and easy to interact with. Display 10-15 phrase cards in this section.","type":"feature","passes":true,"id":15},{"description":"Build Section C: Practice Activity with interactive swipeable flashcard deck. Cards should swipe right for 'I know this' (green) and swipe left for 'Practice again' (orange). Include audio playback button on each card, progress counter showing cards completed, and smooth swipe animations. Make it feel like a mobile flashcard app.","type":"feature","passes":true,"id":16},{"description":"Create Section D: Real-Life Scenario with illustrated situation image (e.g., restaurant scene), dialogue script displayed in both English and Spanish side-by-side, role-play audio that plays the dialogue with pauses prompting 'Now YOU respond...', and recording button for user to practice their response. Include playback of user recording. Make it immersive and practical.","type":"feature","passes":true,"id":17},{"description":"Build Section E: Quick Quiz with 5 multiple choice or fill-in-blank questions, immediate feedback showing correct/incorrect with explanations, score tracking, and smooth transitions between questions. Make questions relevant to lesson content.","type":"feature","passes":true,"id":18},{"description":"Create Section F: Lesson Complete screen with confetti/celebration animation, XP earned display ('+25 XP' with animation), updated streak counter, lesson summary of what was learned, and prominent CTA buttons for 'Continue to Next Lesson' and 'Practice More'. Make completion feel rewarding and motivating.","type":"feature","passes":true,"id":19},{"description":"Wire up navigation so clicking any unlocked lesson from the dashboard opens the full lesson page with all sections. Add smooth scroll-through experience where user progresses section by section. Include 'Mark as Complete' functionality that updates dashboard progress. Add audio recording and playback functionality using Web Audio API.","type":"feature","passes":true,"id":20},{"description":"Create dedicated Audio Practice section accessible from bottom navigation. Build audio library with 9 categories: Core Phrases (100 phrases), Restaurant & Food, Travel & Hotels, Shopping, Emergencies, Workplace, Phone Calls, Meeting People, and Full Conversations. Display categories as browsable cards with emoji icons, phrase counts, and duration estimates. Make navigation intuitive.","type":"feature","passes":true,"id":21},{"description":"Build comprehensive audio player with: Play/Pause button, Repeat/loop current phrase button, Speed control with options (0.5x, 0.75x, 1x, 1.25x), Skip forward/backward buttons, Shuffle mode toggle, progress scrubber, current time and total duration display, and visual waveform or audio visualization. Make player sticky at bottom and visually polished.","type":"feature","passes":true,"id":22},{"description":"Create Listen & Repeat mode that: plays audio phrase, provides 3-second pause for user to repeat, plays phrase again for reinforcement, auto-advances to next phrase, and includes session length options (5, 10, 15, 20 min). Add visual countdown during pause, session timer, and progress tracking. Make it feel like a guided practice session.","type":"feature","passes":true,"id":23},{"description":"Generate and display Audio Pack 1 - 100 Core Phrases with essential Spanish-English translations including: greetings (Hello/Hola, Goodbye/Adiós), polite phrases (Thank you/Gracias, Please/Por favor), yes/no, help phrases (I need help/Necesito ayuda, I don't understand/No entiendo), questions (Can you repeat/¿Puede repetir?, Where is the bathroom/¿Dónde está el baño?), numbers 1-20, days of week, basic verbs, common adjectives, time expressions, and other essential everyday phrases. Display in organized list with bilingual text and audio buttons.","type":"feature","passes":true,"id":24},{"description":"Generate Audio Pack 2 - Restaurant & Food (20+ phrases) including: ordering food and drinks (I'll take the chicken/Voy a llevar el pollo, Can I have water/¿Me puede dar agua?), making requests, asking for the check (The check please/La cuenta por favor), dietary restrictions, compliments to chef, asking for recommendations, table reservations, payment phrases. Display with category organization.","type":"feature","passes":true,"id":25},{"description":"Generate Audio Pack 3 - Travel & Hotels (20+ phrases) including: asking for directions (Where is the bus/¿Dónde está el autobús?), making reservations (I have a reservation/Tengo una reservación), checking in/out, asking about amenities, transportation phrases, airport vocabulary, asking for help with luggage, requesting room service. Organize clearly within travel category.","type":"feature","passes":true,"id":26},{"description":"Generate Audio Pack 4 - Emergencies (15+ phrases) including: calling for help (Call the police/Llame a la policía, I need a doctor/Necesito un doctor), medical emergencies, lost items, accidents, asking for embassy, reporting theft, urgent situations. Also generate Audio Pack 5 - Shopping (20+ phrases) with: asking prices, trying on clothes, payment methods, returns/exchanges, bargaining phrases, store locations.","type":"feature","passes":true,"id":27},{"description":"Generate Audio Pack 6 - Workplace (20+ phrases), Audio Pack 7 - Phone Calls (15+ phrases), Audio Pack 8 - Meeting People (20+ phrases), and Audio Pack 9 - Full Conversations (10+ dialogue scenarios). Include professional greetings, phone etiquette, introductions, small talk, asking about family, making plans, having coffee conversations, etc. Make all packs comprehensive and practical.","type":"feature","passes":true,"id":28},{"description":"Add audio player functionality: download for offline use button, playlist creation, favorites system, history of recently played phrases, and background play capability indication. Wire up all audio controls to work with simulated audio (or placeholder audio). Add keyboard shortcuts for power users. Make the entire audio section feel like a professional language learning audio app.","type":"feature","passes":true,"id":29},{"description":"Create Workbook section accessible from bottom navigation with navigation tabs for different exercise types: Translation, Fill-in-Blank, Matching, Listening, Speaking, Conversations, and Practice Log. Display workbook overview with progress tracking for each exercise type and overall completion percentage.","type":"feature","passes":true,"id":30},{"description":"Build Translation exercise type with: English to Spanish and Spanish to English modes, 20+ translation questions per mode, text input for answers, immediate feedback showing correct/incorrect with proper translation, score tracking, and retry option. Include mix of difficulty levels from basic phrases to complex sentences.","type":"feature","passes":true,"id":31},{"description":"Create Fill-in-Blank exercises with: dropdown selection and type answer modes, 25+ exercises with sentences missing key words, context clues, multiple choice options for dropdown mode, immediate validation, hints button, and progress tracking. Make exercises contextually relevant to lesson content.","type":"feature","passes":true,"id":32},{"description":"Build Matching exercise with drag-and-drop functionality: display 10-12 phrases on left and translations on right, allow dragging phrases to match translations, visual feedback for correct/incorrect matches, shuffle button, check answers button, and celebration on completion. Include touch support for mobile. Create multiple matching sets across different topics.","type":"feature","passes":true,"id":33},{"description":"Create Listening Comprehension exercises: play audio phrase, display 4 multiple choice written options, user selects correct transcription, immediate feedback, replay audio button, 20+ listening questions across difficulty levels, score tracking, and progress through exercise set. Use phrases from audio library.","type":"feature","passes":true,"id":34},{"description":"Build Speaking Prompts section with: scenario cards showing real-life situations (ordering food, asking directions, meeting someone, emergency, etc.), prompt text describing what to say, record response button with audio recording, playback of recording, save recording option, suggested answer shown after recording, and ability to re-record. Include 15+ different scenario prompts.","type":"feature","passes":true,"id":35},{"description":"Create Conversation Completion exercises: display dialogues with missing lines, user fills in appropriate responses (text input), context provided by surrounding dialogue, multiple valid answers accepted, example answers shown after submission, difficulty progression from simple to complex conversations, 10+ conversation scenarios covering various topics.","type":"feature","passes":true,"id":36},{"description":"Build Practice Log feature with: calendar view, daily entries with date, list of phrases practiced (searchable from phrase library), confidence rating 1-5 stars for each session, notes text area for reflections, tomorrow's goal field, streak tracking, weekly summary stats, and filter/search past entries. Make it feel like a learning journal.","type":"feature","passes":true,"id":37},{"description":"Add PDF download and print functionality: generate PDF button on each exercise type with formatted exercises and answer keys on separate pages, overall workbook PDF download with all exercises compiled, clean print-friendly styling with proper page breaks, answer key toggle option, progress report PDF with stats and completed exercises. Use browser print API or PDF generation library.","type":"feature","passes":true,"id":38},{"description":"Create Progress/Achievements section accessible from 🏆 bottom navigation tab. Build XP tracking system that awards points for: lesson complete (+25 XP), perfect quiz (+50 XP), daily login (+10 XP), 7-day streak (+100 XP bonus), record speaking (+15 XP), workbook exercise (+20 XP), module complete (+200 XP). Display total XP with animated counter and XP earned today.","type":"feature","passes":true,"id":39},{"description":"Build level progression system with 5 levels: Beginner (0-500 XP), Explorer (501-1500 XP), Communicator (1501-3000 XP), Confident Speaker (3001-5000 XP), Bilingual Master (5001+ XP). Display current level with visual progress bar to next level, level badge/icon, XP needed for next level, and level-up celebration animation when reaching new level. Show level benefits or unlocks.","type":"feature","passes":true,"id":40},{"description":"Create badge system with 9 achievement badges: First Flame (complete first lesson), Week Warrior (7-day streak), Voice Activated (record 10 speaking exercises), Food Fluent (complete Restaurant module), Ready to Travel (complete Travel lessons), Confidence Builder (complete Module 3), Graduate (finish all modules), Perfectionist (get 100% on 5 quizzes), Bilingual Boss (reach 5000+ XP). Display badge collection gallery with locked/unlocked states, earning date, badge descriptions, and progress toward locked badges.","type":"feature","passes":true,"id":41},{"description":"Build notification/toast system with animated pop-ups for: XP earned ('+25 XP' floating notification), level up achievements, badge unlocked celebrations, streak milestones, and perfect quiz completions. Position toasts in top-right corner with slide-in animation, auto-dismiss after 5 seconds, and success/achievement visual styling with icons and colors.","type":"feature","passes":true,"id":42},{"description":"Create daily reminder system with notification permission request, scheduled reminder at user's preferred time (selectable in settings), reminder content showing streak count and daily goal status, streak warning if user hasn't completed daily goal by evening, and motivational messages. Include settings panel for enabling/disabling reminders and choosing time.","type":"feature","passes":true,"id":43},{"description":"Build weekly summary report that generates every Sunday evening or Monday morning showing: total XP earned this week, lessons completed count, quiz scores average, speaking exercises recorded, workbook completion percentage, current streak, badges earned this week, time spent learning, and comparison to previous week with trends. Display in modal or dedicated summary page with share option.","type":"feature","passes":true,"id":44},{"description":"Add motivational quotes system that displays inspirational language learning quotes in notifications, on dashboard, and in weekly summaries. Create collection of 20+ motivational quotes about learning, persistence, and bilingualism. Rotate quotes daily. Include quotes in multiple languages with translations.","type":"feature","passes":true,"id":45},{"description":"Wire up XP system throughout app: connect lesson completion to award XP, track quiz scores and award bonus XP for perfect scores, detect daily logins and award XP, monitor streak and award bonus for 7-day milestone, integrate with speaking exercises and workbook, update level when XP thresholds crossed, unlock badges based on achievements, trigger notifications for all XP events. Create persistent storage for user XP, level, and badges. Make gamification feel integrated and rewarding throughout entire app.","type":"feature","passes":true,"id":46}]